/*
 * 打印英雄联盟[(因为没有怎么玩过 所以就换成王者荣耀( S9 版本)]里你最喜欢的五个英雄
 * 他们的生命值、攻击力、速度、生命恢复、护甲值等等.
 */

#include <stdio.h>

int main(void) {

  // 输出 阿珂 的属性
  printf("name: %s\n" , "阿珂");
  printf("最大生命: %s\n" , "3269");
  printf("物理攻击: %s\n" , "177");
  printf("速度: %s\n" , "380");
  printf("暴击效果(因为 生命恢复 不详 所以换成 暴击效果): %s\n" , "200%%");
  printf("最大护甲值: %s\n" , "89");
  putchar('\n');

  // 输出 娜可露露 的属性
  printf("name: %s\n" , "娜可露露");
  printf("最大生命: %s\n" , "3239");
  printf("理攻击: %s\n" , "173");
  printf("速度: %s\n" , "380");
  printf("暴击效果(因为 生命恢复 不详 所以换成 暴击效果): %s\n" , "200%%");
  printf("最大护甲值: %s\n" , "86");
  putchar('\n');
  
  // 输出 诸葛亮 的属性
  printf("name: %s\n" , "诸葛亮");
  printf("最大生命: %s\n" , "3125");
  printf("物理攻击: %s\n" , "490");
  printf("速度: %s\n" , "350");
  printf("暴击效果(因为 生命恢复 不详 所以换成 暴击效果): %s\n" , "200%%");
  printf("最大护甲值: %s\n" , "87");
  putchar('\n');

  // 输出 刘备 的属性
  printf("name: %s\n" , "刘备");
  printf("最大生命: %s\n" , "3225");
  printf("物理攻击: %s\n" , "163");
  printf("速度: %s\n" , "380");
  printf("暴击效果(因为 生命恢复 不详 所以换成 暴击效果): %s\n" , "200%%");
  printf("最大护甲值: %s\n" , "113");
  putchar('\n');

  // 输出 东皇太一 的属性
  printf("name: %s\n" , "东皇太一");
  printf("最大生命: %s\n" , "3201");
  printf("物理攻击: %s\n" , "470");
  printf("速度: %s\n" , "350");
  printf("暴击效果(因为 生命恢复 不详 所以换成 暴击效果): %s\n" , "200%%");
  printf("最大护甲值: %s\n" , "99");
  putchar('\n');
  
  getchar();
  /*
   * 让程序停一下
   * 不会直接闪退
   */
  return 0;
}
