// 这一 C 文件全为打字没有 Code 我也不知道为什么 千锋 会让我打故事

* 在神秘的数字王国里 , 胖子 "0" 与瘦子  "1" 这两个 "小有名气" 的数字 , 常
常为了谁重要而争执不休. 瞧 ! 今天 , 这两个小冤家狭路相逢 , 彼此之间
又展开了一场舌战.

* 瘦子 "1" 抢先发言: "哼 ! 胖胖的 '0' , 你有什么了不起 ? 就像 100 , 如果没
有我这个瘦子 '1' , 你这两个胖 '0' 有什么用 ?"

* 胖子 "0" 不服气了: "你也甭在我这耍威风 , 想想看 , 要是没有我 , 你上
哪找其它数来组成 100 呢?"

* "哟 !" 瘦子 "1" 不甘示弱 , "你再神气也不过是表示什么也没有 , 看 ! '1 + 0' 还
不照样等于我本身 , 你哪点儿派得上用场啦 ?"

* "去 ! '1 * 0' 结果也还不是我 , 你 '1' 不也同样没用" "0" 针锋相对.
"你······" "1" 顿了顿 , 随机应变道 , "不管怎么说 , 你 '0' 就是表示什么也没
有 !"

* "这就是你见识少了." "0" 不慌不忙地说 , "你看 , 日常生活中 , 气温 0 度
, 难道是没有温度吗 ? 再比如 , 直尺上没有我作为起点 , 哪有你 '1' 呢 ?"

* "再怎么比 , 你也只能做中间数或位数 , 如 1037、1307 , 永远不能领头." 
"1"信心十足地说.

* 听了这话 , "0" 更显得理直气壮地说:"这可说不定了 , 如 0.1 , 没有我这
个 '0' 来站位 , 你可怎么办 ?"

* 眼看着胖子 "0" 与瘦子 "1" 争得脸红耳赤 , 谁也不让谁 , 一旁观战的其它数
字们都十分着急.

* 这时 , "9" 灵机一动 , 上前做了个暂停的手势:"你俩都别争了 , 瞧你们 ,
'1'、'0'有哪个比我大?"

* "这······" 胖子 "0"、瘦子 "1" 哑口无言。

* 这时 , "9" 才心平气和地说:"'1'、'0' , 其实 , 只要你们站在一起 , 不就比
我大了吗 ?"

* "1"、"0" 面面相觑 , 半晌才搔搔头笑了. "这才对嘛 !" "9" 语重心长地说.
