/*
 * NO.FIVE 译密码
 *
 * 例如:
 * 将字母 'A' 变成字母 'E'
 * 'a' 变成 'e'
 * 即变成其后的第 4 个字母
 * 遇到 W(w)、X(x)、Y(y)、Z(z) 将变成
 *     A(a)、B(b)、C(c)、D(d)
 */

#include <stdio.h>

int main(void) {

  // 定义所需变量
  char c1 , c2 , c3 , c4 , c5;

  // 叫用户输入 原文
  printf("Enter five character:\n");
  // 将用户输入的 原文 存入五个变量中
  scanf("%c%c%c%c%c" ,
         &c1 , &c2 , &c3 , &c4 , &c5);

  // 判断 c1 是否为特殊字母
  if ((c1 >= 'W') && ('Z' >= c1) ||
      (c1 >= 'w') && ('z' >= c1)) {
    // 将 c1 译为 密码字符
    c1 -= 22;
  } else {
    c1 += 4;
  }
  // 判断 c2 是否为特殊字母
  if ((c2 >= 'W') && ('Z' >= c2) ||
      (c2 >= 'w') && ('z' >= c2)) {
    // 将 c2 译为 密码字符
    c2 -= 22;
  } else {
    c2 += 4;
  }
  // 判断 c3 是否为特殊字母
  if ((c3 >= 'W') && ('Z' >= c3) ||
      (c3 >= 'w') && ('z' >= c3)) {
    // 将 c3 译为 密码字符
    c3 -= 22;
  } else {
    c3 += 4;
  }
  // 判断 c4 是否为特还字母
  if ((c4 >= 'W') && ('Z' >= c4) ||
      (c4 >= 'w') && ('z' >= c4)) {
    // 将 c4 译为 密码字符
    c4 -= 22;
  } else {
    c4 += 4;
  }
  // 判断 c5 是否为特殊字母
  if ((c5 >= 'W') && ('Z' >= c5) ||
      (c5 >= 'w') && ('z' >= c5)) {
    // 将 c5 译为 密码字符
    c5 -= 22;
  } else {
    c5 += 4;
  }

  // 输出译成的 密码
  printf("密码是: %c%c%c%c%c\n" ,
          c1 , c2 , c3 , c4 , c5);

  return 0;
}
